<template lang="pug">.
    .topic(data-topic="0")
        |Topic 0
        p
            |好处：1、内存安全（运行时检查清除失效DOM和weakmap自动GC）；2、api设计的很干净。
</template>



<script lang="ts">
    import { defineComponent } from "vue"

    export default defineComponent({
        name: 'topic-0',
        components:
        {
            
        },
        setup()
        {
            // data ----------------------------------------------------------------------------------------------------
            // 0 //
            // return --------------------------------------------------------------------------------------------------
        },
    })
</script>



<style lang="stylus">
@import _colorset

// 状态样式 -------------------------------------------------------------------------------------------------------------

// 基础样式 -------------------------------------------------------------------------------------------------------------
.
    // 
</style>
