<template lang="pug">.
    .topic(data-topic="0")
        |主题 0
        p
            |一定要指出的，本工具库的好处有：内存安全（用了工具自身运行时检查清除和weakmap自动GC）
</template>



<script lang="ts">
    import { defineComponent } from "vue"

    export default defineComponent({
        name: 'topic-0',
        components:
        {
            
        },
        setup()
        {
            // data ----------------------------------------------------------------------------------------------------
            // 0 //
            // return --------------------------------------------------------------------------------------------------
        },
    })
</script>



<style lang="stylus">
@import _colorset

// 状态样式 -------------------------------------------------------------------------------------------------------------

// 基础样式 -------------------------------------------------------------------------------------------------------------
.
    // 
</style>
